/*Од стандарден влез се внесуваат два цели броја N и Х.
Да се најде најблискот број помал од N коj е тотално различен од бројот Х.
Еден број е тотално различен од друг ако и само ако во него не се појавува ниту една од цифрите на другиот број.
Задачата да се реши без употреба на низи и матрици.*/

#include <stdio.h> 
int main(){
    
    int n, x, a, b, cifa, cifb, i, tr;
    scanf("%d %d", &n, &x);
    for(i=n-1; i>=0; i--){
        a=i;
        tr=1;
        while(a){
            cifa=a%10;
            b=x;
            while(b){
                cifb=b%10;
                if(cifa==cifb) {tr=0;}
                b/=10;
            }
            a/=10;
        }
        if(tr){printf("%d", i); break;}
    }
    
    return 0;
}
